Cleanup + examples
